# SetEvaluator Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
FilterStringRule..::..SetEvaluator Method
FilterStringRule Class See Also
---
Sets the evaluator that implements the test for this rule.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2011
# Syntax
C#
---
```text
public void SetEvaluator(
	FilterStringRuleEvaluator evaluator
)
```

Visual Basic
---
```text
Public Sub SetEvaluator ( _
	evaluator As FilterStringRuleEvaluator _
)
```

Visual C++
---
```text
public:
void SetEvaluator(
	FilterStringRuleEvaluator^ evaluator
)
```

# ### Parameters
evaluator
    Type: Autodesk.Revit.DB..::..FilterStringRuleEvaluator
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
FilterStringRule Class
Autodesk.Revit.DB Namespace